In [1]:
import pandas as pd
import numpy as np

# librerías de visualización
import seaborn as sns
import matplotlib.pyplot as plt

import warnings
warnings.filterwarnings("ignore")

# Demography

In [2]:
# cargamos el dataset
df_demo = pd.read_excel("../data/raw_data/Telco_customer_churn_demographics.xlsx")
df_demo.head()

,Customer ID,Count,Gender,Age,Under 30,Senior Citizen,Married,Dependents,Number of Dependents
0,8779-QRDMV,1,Male,78,No,Yes,No,No,0
1,7495-OOKFY,1,Female,74,No,Yes,Yes,Yes,1
2,1658-BYGOY,1,Male,71,No,Yes,No,Yes,3
3,4598-XLKNJ,1,Female,78,No,Yes,Yes,Yes,1
4,4846-WHAFZ,1,Female,80,No,Yes,Yes,Yes,1

In [3]:
df_demo.drop(columns=["Under 30","Senior Citizen","Dependents"], axis=1, inplace=True)

In [4]:
df_demo.isnull().sum()

Customer ID             0
Count                   0
Gender                  0
Age                     0
Married                 0
Number of Dependents    0
dtype: int64

In [5]:
df_demo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 6 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Customer ID           7043 non-null   object
 1   Count                 7043 non-null   int64
 2   Gender                7043 non-null   object
 3   Age                   7043 non-null   int64
 4   Married               7043 non-null   object
 5   Number of Dependents  7043 non-null   int64
dtypes: int64(3), object(3)
memory usage: 330.3+ KB

In [6]:
df_demo.head()

  Customer ID  Count  Gender  Age Married  Number of Dependents
0  8779-QRDMV      1    Male   78      No                     0
1  7495-OOKFY      1  Female   74     Yes                     1
2  1658-BYGOY      1    Male   71      No                     3
3  4598-XLKNJ      1  Female   78     Yes                     1
4  4846-WHAFZ      1  Female   80     Yes                     1

In [7]:
#SQL
df_demo.to_csv('../data/SQL/df_demo.csv', index=False)

# Localization

In [15]:
df_loc = pd.read_excel("../data/raw_data/Telco_customer_churn_location.xlsx")
df_loc.head()

,Customer ID,Count,Country,State,City,Zip Code,Lat Long,Latitude,Longitude
0,8779-QRDMV,1,United States,California,Los Angeles,90022,"34.02381, -118.156582",34.023810,-118.156582
1,7495-OOKFY,1,United States,California,Los Angeles,90063,"34.044271, -118.185237",34.044271,-118.185237
2,1658-BYGOY,1,United States,California,Los Angeles,90065,"34.108833, -118.229715",34.108833,-118.229715
3,4598-XLKNJ,1,United States,California,Inglewood,90303,"33.936291, -118.332639",33.936291,-118.332639
4,4846-WHAFZ,1,United States,California,Whittier,90602,"33.972119, -118.020188",33.972119,-118.020188

In [16]:
df_loc["Count"].unique()

array([1])

In [17]:
df_loc["Country"].unique()

array(['United States'], dtype=object)

In [18]:
df_loc["State"].unique()

array(['California'], dtype=object)

In [19]:
df_loc["City"].unique()

array(['Los Angeles', 'Inglewood', 'Whittier', ..., 'Topaz', 'Jacumba',
       'Holtville'], dtype=object)

In [20]:
df_loc.drop(columns=["Country","State","Lat Long","Count"], axis=1, inplace=True)

In [21]:
df_loc.head()

  Customer ID         City  Zip Code   Latitude   Longitude
0  8779-QRDMV  Los Angeles     90022  34.023810 -118.156582
1  7495-OOKFY  Los Angeles     90063  34.044271 -118.185237
2  1658-BYGOY  Los Angeles     90065  34.108833 -118.229715
3  4598-XLKNJ    Inglewood     90303  33.936291 -118.332639
4  4846-WHAFZ     Whittier     90602  33.972119 -118.020188

In [22]:
#SQL
df_loc.to_csv('../data/SQL/df_loc.csv', index=False)

In [23]:
#Tableau 
df_loc.to_csv('../data/Tableau/df_loc.csv', index=False)

In [24]:
df_loc.drop(columns=["Latitude","Longitude"], axis=1, inplace=True)

In [25]:
df_loc.head(1)

  Customer ID         City  Zip Code
0  8779-QRDMV  Los Angeles     90022

In [26]:
df_loc.isnull().sum()

Customer ID    0
City           0
Zip Code       0
dtype: int64

In [27]:
df_loc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Customer ID  7043 non-null   object
 1   City         7043 non-null   object
 2   Zip Code     7043 non-null   int64
dtypes: int64(1), object(2)
memory usage: 165.2+ KB

# Population

In [28]:
df_pop = pd.read_excel("../data/raw_data/Telco_customer_churn_population.xlsx")
df_pop.head()

   ID  Zip Code  Population
0   1     90001       54492
1   2     90002       44586
2   3     90003       58198
3   4     90004       67852
4   5     90005       43019

In [29]:
df_loc_pop = pd.merge(df_loc, df_pop, on='Zip Code')

In [30]:
df_loc_pop.head()

  Customer ID         City  Zip Code  ID  Population
0  8779-QRDMV  Los Angeles     90022  21       68701
1  4737-AQCPU  Los Angeles     90022  21       68701
2  5043-TRZWM  Los Angeles     90022  21       68701
3  8165-CBKXO  Los Angeles     90022  21       68701
4  9979-RGMZT  Los Angeles     90022  21       68701

In [31]:
df_loc_pop.drop(columns=["ID","Zip Code"], axis=1, inplace=True)

In [32]:
df_loc_pop.head(1)

  Customer ID         City  Population
0  8779-QRDMV  Los Angeles       68701

In [33]:
#SQL
df_loc.to_csv('../data/SQL/df_loc.csv', index=False)

In [34]:
df_demo.head()

  Customer ID  Count  Gender  Age Married  Number of Dependents
0  8779-QRDMV      1    Male   78      No                     0
1  7495-OOKFY      1  Female   74     Yes                     1
2  1658-BYGOY      1    Male   71      No                     3
3  4598-XLKNJ      1  Female   78     Yes                     1
4  4846-WHAFZ      1  Female   80     Yes                     1

In [38]:
df_final = pd.merge(df_demo, df_loc_pop, on='Customer ID')

In [39]:
df_final.head()

,Customer ID,Count,Gender,Age,Married,Number of Dependents,City,Population
0,8779-QRDMV,1,Male,78,No,0,Los Angeles,68701
1,7495-OOKFY,1,Female,74,Yes,1,Los Angeles,55668
2,1658-BYGOY,1,Male,71,No,3,Los Angeles,47534
3,4598-XLKNJ,1,Female,78,Yes,1,Inglewood,27778
4,4846-WHAFZ,1,Female,80,Yes,1,Whittier,26265

# Services

In [47]:
df_services = pd.read_excel("../data/raw_data/Telco_customer_churn_services.xlsx")
df_services.head()

,Customer ID,Count,Quarter,Referred a Friend,Number of Referrals,Tenure in Months,Offer,Phone Service,Avg Monthly Long Distance Charges,Multiple Lines,...,Unlimited Data,Contract,Paperless Billing,Payment Method,Monthly Charge,Total Charges,Total Refunds,Total Extra Data Charges,Total Long Distance Charges,Total Revenue
0,8779-QRDMV,1,Q3,No,0,1,None,No,0.00,No,...,No,Month-to-Month,Yes,Bank Withdrawal,39.65,39.65,0.00,20,0.00,59.65
1,7495-OOKFY,1,Q3,Yes,1,8,Offer E,Yes,48.85,Yes,...,Yes,Month-to-Month,Yes,Credit Card,80.65,633.30,0.00,0,390.80,1024.10
2,1658-BYGOY,1,Q3,No,0,18,Offer D,Yes,11.33,Yes,...,Yes,Month-to-Month,Yes,Bank Withdrawal,95.45,1752.55,45.61,0,203.94,1910.88
3,4598-XLKNJ,1,Q3,Yes,1,25,Offer C,Yes,19.76,No,...,Yes,Month-to-Month,Yes,Bank Withdrawal,98.50,2514.50,13.43,0,494.00,2995.07
4,4846-WHAFZ,1,Q3,Yes,1,37,Offer C,Yes,6.33,Yes,...,Yes,Month-to-Month,Yes,Bank Withdrawal,76.50,2868.15,0.00,0,234.21,3102.36

In [48]:
df_services.drop(columns=["Count","Quarter","Paperless Billing"], axis=1, inplace=True)

In [49]:
df_services.head(2)

,Customer ID,Referred a Friend,Number of Referrals,Tenure in Months,Offer,Phone Service,Avg Monthly Long Distance Charges,Multiple Lines,Internet Service,Internet Type,...,Streaming Music,Unlimited Data,Contract,Payment Method,Monthly Charge,Total Charges,Total Refunds,Total Extra Data Charges,Total Long Distance Charges,Total Revenue
0,8779-QRDMV,No,0,1,None,No,0.00,No,Yes,DSL,...,No,No,Month-to-Month,Bank Withdrawal,39.65,39.65,0.0,20,0.0,59.65
1,7495-OOKFY,Yes,1,8,Offer E,Yes,48.85,Yes,Yes,Fiber Optic,...,No,Yes,Month-to-Month,Credit Card,80.65,633.30,0.0,0,390.8,1024.10

In [46]:
df_services["Contract"].unique

<bound method Series.unique of 0       Month-to-Month
1       Month-to-Month
2       Month-to-Month
3       Month-to-Month
4       Month-to-Month
             ...
7038          Two Year
7039          One Year
7040          One Year
7041    Month-to-Month
7042          Two Year
Name: Contract, Length: 7043, dtype: object>

In [53]:
#SQL
df_services.to_csv('../data/SQL/df_services.csv', index=False)

# Status

In [54]:
df_status = pd.read_excel("../data/raw_data/Telco_customer_churn_status.xlsx")
df_status.head()

,Customer ID,Count,Quarter,Satisfaction Score,Customer Status,Churn Label,Churn Value,Churn Score,CLTV,Churn Category,Churn Reason
0,8779-QRDMV,1,Q3,3,Churned,Yes,1,91,5433,Competitor,Competitor offered more data
1,7495-OOKFY,1,Q3,3,Churned,Yes,1,69,5302,Competitor,Competitor made better offer
2,1658-BYGOY,1,Q3,2,Churned,Yes,1,81,3179,Competitor,Competitor made better offer
3,4598-XLKNJ,1,Q3,2,Churned,Yes,1,88,5337,Dissatisfaction,Limited range of services
4,4846-WHAFZ,1,Q3,2,Churned,Yes,1,67,2793,Price,Extra data charges

In [56]:
df_status["Quarter"].unique()

array(['Q3'], dtype=object)

In [57]:
df_status["Churn Label"].unique()

array(['Yes', 'No'], dtype=object)

In [59]:
df_status.drop(columns=["Quarter","Churn Label"], axis=1, inplace=True)

In [60]:
df_status.head(2)

,Customer ID,Count,Satisfaction Score,Customer Status,Churn Value,Churn Score,CLTV,Churn Category,Churn Reason
0,8779-QRDMV,1,3,Churned,1,91,5433,Competitor,Competitor offered more data
1,7495-OOKFY,1,3,Churned,1,69,5302,Competitor,Competitor made better offer

In [62]:
#SQL
df_status.to_csv('../data/SQL/df_status.csv', index=False)

# Churn

In [63]:
df_churn = pd.read_excel("../data/raw_data/Telco_customer_churn.xlsx")
df_churn.head()

,CustomerID,Count,Country,State,City,Zip Code,Lat Long,Latitude,Longitude,Gender,...,Contract,Paperless Billing,Payment Method,Monthly Charges,Total Charges,Churn Label,Churn Value,Churn Score,CLTV,Churn Reason
0,3668-QPYBK,1,United States,California,Los Angeles,90003,"33.964131, -118.272783",33.964131,-118.272783,Male,...,Month-to-month,Yes,Mailed check,53.85,108.15,Yes,1,86,3239,Competitor made better offer
1,9237-HQITU,1,United States,California,Los Angeles,90005,"34.059281, -118.30742",34.059281,-118.307420,Female,...,Month-to-month,Yes,Electronic check,70.70,151.65,Yes,1,67,2701,Moved
2,9305-CDSKC,1,United States,California,Los Angeles,90006,"34.048013, -118.293953",34.048013,-118.293953,Female,...,Month-to-month,Yes,Electronic check,99.65,820.5,Yes,1,86,5372,Moved
3,7892-POOKP,1,United States,California,Los Angeles,90010,"34.062125, -118.315709",34.062125,-118.315709,Female,...,Month-to-month,Yes,Electronic check,104.80,3046.05,Yes,1,84,5003,Moved
4,0280-XJGEX,1,United States,California,Los Angeles,90015,"34.039224, -118.266293",34.039224,-118.266293,Male,...,Month-to-month,Yes,Bank transfer (automatic),103.70,5036.3,Yes,1,89,5340,Competitor had better devices